* DIRED Modifications

#+BEGIN_SRC elisp :tangle ~/.doom.d/config.el
(use-package! dired-collapse)
(use-package! dired-hide-dotfiles)

(defun gcj/dired ()
  "GCJ Hide stuff"
  (dired-hide-dotfiles-mode)
  (dired-collapse-mode)
  )

;; This is more useful than hardlink
(map! :map dired-mode-map
      :nv  "H" #'dired-hide-dotfiles-mode)     ; normal+visual

(add-hook! 'dired-mode-hook 'gcj/dired)
#+END_SRC

#+RESULTS:
| dired-extra-startup | doom--recentf-add-dired-directory-h | doom-modeline-set-project-modeline | gcj/dired | +dired-disable-gnu-ls-flags-in-tramp-buffers-h | dired-omit-mode | all-the-icons-dired-mode | diff-hl-dired-mode-unless-remote | diredfl-mode |

